{"_id":{"$oid":"564628d7ecd3c0c7ab98fd78"},"owner":"Erty Seidohl","title":"Java Phrasebook","author":"Timothy Fisher","synopsis":"Java Phrasebook gives you the code phrases you need to quickly and effectively complete you programming projects in Java.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":"","co_date":"Tue Nov 17 2015 09:40:15 GMT-0700 (MST)","due_date":"Tue Dec 01 2015 09:40:15 GMT-0700 (MST)"}
{"_id":{"$oid":"56462985ecd3c0c7ab98fd79"},"owner":"Erty Seidohl","title":"Modern Operating Systems","author":"Andrew S. Tanenbaum","synopsis":"A complete overview of Modern Operating Systems and how they work.\n","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":"","co_date":"Tue Nov 17 2015 09:40:23 GMT-0700 (MST)","due_date":"Tue Dec 01 2015 09:40:23 GMT-0700 (MST)"}
{"_id":{"$oid":"56462a24ecd3c0c7ab98fd7a"},"owner":"Erty Seidohl","title":"Java Puzzlers","author":"Joshua Bloch \u0026 Neal Gafter","synopsis":"How well do you really know Java? Are you a code sleuth? Have you ever spend days chasing a bug caused by a trap or pitfall in Java or its libraries?  Do you like brainteasers?  Then this is the book for you!\n\nDive deep into the subtleties of the Java programming language and its core libraries.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"56462ac1ecd3c0c7ab98fd7b"},"owner":"Erty Seidohl","title":"The Web Designer's Idea Book: Volume 2","author":"Patrick McNeil","synopsis":"Volume 2 of \"The Web Designer's Idea Book\" includes more than 650 new websites arranged thematically, so you can easily find inspiration for your work.  Patrick McNeil, creator of the popular web design blog \"designmeltdown.com\" has cataloged thousands of sites, and showcases the latest and best examples in this book.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"56462bb7ecd3c0c7ab98fd7c"},"owner":"Erty Seidohl","title":"Game Engine Architecture","author":"Jason Gregory","synopsis":"This book covers both the theory and practice of game engine software development, bringing together complete coverage of a wide range of topics.\n\nTopics include:\n*large-scale C++ software architecture in a games context\n*mathematics for game programming\n*game development tools for debugging, source control, and profiling\n*engine subsystems including engine foundation systems, rendering, collision, physics, character animation, and game world object models\n*multiplatform game engines\n*game programming in multiprocessor environments\n*tool pipelines and the game asset database","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"56462c3becd3c0c7ab98fd7d"},"owner":"Erty Seidohl","title":"Smashing Logo Design: The Art of Creating Visual Identities","author":"Gareth Hardy","synopsis":"Taking you beyond the pretty picture to the techniques behind the logo.  \"Smashing Logo Design\" goes much further than simply showcasing pretty pictures. It covers the design theory and the techniques needed to build great-looking logos.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"56462cc7ecd3c0c7ab98fd7e"},"owner":"Erty Seidohl","title":"Letting Go of the Words: Writing Web Content That Works","author":"Janice (Ginny) Redish","synopsis":"Learn how to create useful and usable content as conversation for the web from the master - Ginny Redish.\n\nWith this new edition (2nd edition), you'll find strategy, process, and tactics for creating or revising content for the web.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"56462cfaecd3c0c7ab98fd7f"},"owner":"Erty Seidohl","title":"Type Matters","author":"Jim Williams","synopsis":"Simple tips for everyday typography.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"56462d71ecd3c0c7ab98fd80"},"owner":"Erty Seidohl","title":"Beginning DirectX 10 Game Programming","author":"Wendy Jones","synopsis":"Discover the exciting world of game programming and 3D graphics creation using DirectX 10!  \"Beginning DirectX 10 Game Programming\" is an introductory guide to creating fantastic graphics, amazing creatures, and realistic worlds for games.  Written specifically for the beginner programmer.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"56462dc0ecd3c0c7ab98fd81"},"owner":"Erty Seidohl","title":"Above the Fold","author":"Brian Miller","synopsis":"Understanding the Principles of Successful Web Site Design","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"56462ea0ecd3c0c7ab98fd82"},"owner":"Erty Seidohl","title":"Introduction to Algorithms","author":"Thomas H. Cormen, Charles E. Leiserson, Ronald L. Rivest, Clifford Stein","synopsis":"\"Introduction to Algorithms\" uniquely combines rigor and comprehensiveness.  The book covers a broad range of algorithms in depth, yet makes their design and analysis accessible to all levels of readers.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"564638b7ecd3c0c7ab98fd83"},"owner":"Erty Seidohl","title":"Best of Game Programming Gems","author":"Course Technology - Edited by: Mark DeLoura","synopsis":"Welcome to a collection of the most valuable and timeless articles from the essential reference series for game developers. \"Best of Game Programming Gems\" combines the greatest cutting-edge, ready-to-use techniques contributed by industry experts to volumes 1-6 of the Game Programming Gems series.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"5646391cecd3c0c7ab98fd84"},"owner":"Erty Seidohl","title":"Applied Combinatorics","author":"Alan Tucker","synopsis":"This book is designed for use by students with a wide range of ability and maturity. The stronger the students, the harder the exercises that can be assigned. The book can be used for one-quarter, two-quarter, or one-semester course depending on how much material is used.\nCombinatorical reasoning underlies all analysis of computer systems. It plays a similar role in discrete operations research problems and in finite probability. This book teaches students in the mathematical sciences how to reason and model combinatorically. It seeks to develop proficiency in basic discrete math problem solving in the way that a calculus textbook develops proficiency in basic analysis problem solving.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"56463968ecd3c0c7ab98fd85"},"owner":"Erty Seidohl","title":"A Book of Abstract Algebra","author":"Charles C. Pinter","synopsis":"Accessible but rigorous, this outstanding text encompasses all of the topics covered by a typical course in elementary abstract algebra. Its easy-to-read treatment offers an intuitive approach, featuring informal discussions followed by thematically arranged exercises. Intended for undergraduate courses in abstract algebra, it is suitable for junior- and senior-level math majors and future math teachers. This second edition features additional exercises to improve student familiarity with applications.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"564639bfecd3c0c7ab98fd86"},"owner":"Erty Seidohl","title":"Computer Organization and Design","author":"David A. Patterson \u0026 John L. Hennessy","synopsis":"This Fourth Revised Edition of Computer Organization and Design includes a complete set of updated and new exercises, along with improvements and changes suggested by instructors and students. Focusing on the revolutionary change taking place in industry today--the switch from uniprocessor to multicore microprocessors--this classic textbook has a modern and up-to-date focus on parallelism in all its forms. Examples highlighting multicore and GPU processor designs are supported with performance and benchmarking data. As with previous editions, a MIPS processor is the core used to present the fundamentals of hardware technologies, assembly language, computer arithmetic, pipelining, memory hierarchies and I/O. Sections on the ARM and x86 architectures are also included.\n\nAll disc-based content for this title is now available on the Web.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"564639efecd3c0c7ab98fd87"},"owner":"Erty Seidohl","title":"Operating Systems","author":"Gary Nutt","synopsis":"Operating Systems provides an understanding of contemporary operating system concepts by integrating the principles behind the design of all operating systems with how they are put into practice in the real world. Throughout, Gary Nutt provides a complete discussion of operating concepts and supplements this with real code examples, algorithms, and discussions about implementation issues. The book also includes many lab exercises that provide students with the opportunity to practice with Linux, UNIX, and Windows.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"56463a30ecd3c0c7ab98fd88"},"owner":"Erty Seidohl","title":"Effective JavaScript: 68 Specific Ways to Harness the Power of JavaScript","author":"David Herman","synopsis":"In order to truly master JavaScript, you need to learn how to work effectively with the language’s flexible, expressive features and how to avoid its pitfalls. No matter how long you’ve been writing JavaScript code, Effective JavaScript will help deepen your understanding of this powerful language, so you can build more predictable, reliable, and maintainable programs.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"56463a76ecd3c0c7ab98fd89"},"owner":"Erty Seidohl","title":"Foundations of 3D Computer Graphics","author":"Steven J. Gortler","synopsis":"Computer graphics technology is an amazing success story. Today, all of our PCs are capable of producing high-quality computer-generated images, mostly in the form of video games and virtual-life environments; every summer blockbuster movie includes jaw-dropping computer generated special effects. This book explains the fundamental concepts of 3D computer graphics. It introduces the basic algorithmic technology needed to produce 3D computer graphics, and covers such topics as understanding and manipulating 3D geometric transformations, camera transformations, the image-rendering process, and materials and texture mapping. It also touches on advanced topics including color representations, light simulation, dealing with geometric representations, and producing animated computer graphics.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"56463b20ecd3c0c7ab98fd8a"},"owner":"Erty Seidohl","title":"Game Coding Complete","author":"Mike McShaffry \u0026 David \"Rez\" Graham","synopsis":"Welcome to Game Coding Complete, Fourth Edition, the newest edition of the essential, hands-on guide to developing commercial-quality games. Written by two veteran game programmers, the book examines the entire game development process and all the unique challenges associated with creating a game. In this excellent introduction to game architecture, you'll explore all the major subsystems of modern game engines and learn professional techniques used in actual games, as well as Teapot Wars, a game created specifically for this book. This updated fourth edition uses the latest versions of DirectX and Visual Studio, and it includes expanded chapter coverage of game actors, AI, shader programming, LUA scripting, the C# editor, and other important updates to every chapter. All the code and examples presented have been tested and used in commercial video games, and the book is full of invaluable best practices, professional tips and tricks, and cautionary advice.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"56463b56ecd3c0c7ab98fd8b"},"owner":"Erty Seidohl","title":"Killer Game Programming in Java","author":"Andrew Davison","synopsis":"Although the number of commercial Java games is still small compared to those written in C or C++, the market is expanding rapidly. Recent updates to Java make it faster and easier to create powerful gaming applications-particularly Java 3D-is fueling an explosive growth in Java games. Java games like Puzzle Pirates, Chrome, Star Wars Galaxies, Runescape, Alien Flux, Kingdom of Wars, Law and Order II, Roboforge, Tom Clancy's Politika, and scores of others have earned awards and become bestsellers.Java developers new to graphics and game programming, as well as game developers new to Java 3D, will find Killer Game Programming in Java invaluable. This new book is a practical introduction to the latest Java graphics and game programming technologies and techniques. It is the first book to thoroughly cover Java's 3D capabilities for all types of graphics and game development projects.Killer Game Programming in Java is a comprehensive guide to everything you need to know to program cool, testosterone-drenched Java games. It will give you reusable techniques to create everything from fast, full-screen action games to multiplayer 3D games. In addition to the most thorough coverage of Java 3D available, Killer Game Programming in Java also clearly details the older, better-known 2D APIs, 3D sprites, animated 3D sprites, first-person shooter programming, sound, fractals, and networked games. Killer Game Programming in Java is a must-have for anyone who wants to create adrenaline-fueled games in Java.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"56463c6eecd3c0c7ab98fd8c"},"owner":"Erty Seidohl","title":"Practical Object-Orient Development in C++ and Java","author":"Cay S. Hortsmann","synopsis":"This book offers advice on real-world ways to use these powerful programming languages and techniques.  Using the Unified Modeling Language (UML) methodology, expert Cay S. Horstmann gives you clear, concise explanations of object-oriented design, C++, and Java in a way that makes these potentially daunting operations more accessible than they've ever been before.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"56463e07ecd3c0c7ab98fd8d"},"owner":"BDA","title":"Real World Digital Photography","author":"Katrin Eismann, Sean Dugan, and Tim Grey","synopsis":"Whether you're just making the transition from a lifetime of traditional photography or are looking to bring your digital photography skills in line with today's market, if you're serious about digital photography, you need this book. In the four years since the first edition was published, just about every aspect of digital photography has changed (often radically--and it's all covered in these pages. Organized in four major sections--Digital Processing Essentials, Digital Processing Techniques, The Digital Darkroom, and Output and Presentation--the focus here is on getting great pictures and spectacular printed output through a combination of smart techniques and the right equipment. As with all of the titles in the Real World series, the authors here realize that this entails learning not just techniques but the concepts behind them. For a professional-level understanding of the digital photography process--from how a digital camera works to advice on buying cameras and accessories, choosing hardware and software, downloading and outputting images, and more--this is the place to turn.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"56463e6becd3c0c7ab98fd8e"},"owner":"BDA","title":"Design Basics","author":"David A. Lauer \u0026 Stephen Pentak","synopsis":"Filled with hundreds of stunning examples of successful two dimensional design, this how-to book explains design theory and gives you the tools necessary so you can create successful designs yourself. DESIGN BASICS presents art fundamentals concepts in full two- to four-page spreads, making the text practical and easy for you to refer to while you work.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"56463eacecd3c0c7ab98fd8f"},"owner":"BDA","title":"Feminist Hollywood From Born in Flames to Point Break","author":"Christina Lane","synopsis":"Feminist Hollywood examines the differences between commercial cinema and counter cinema by focusing on the work of contemporary women directors who have entered Hollywood from the realm of independent filmmaking. Christina Lane compares their early documentaries or avant-garde films with their more mainstream endeavors as she explores the possibilities and limits of feminist expression within the male-dominated industry of commercial filmmaking.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"56463f55ecd3c0c7ab98fd90"},"owner":"BDA","title":"How to Motivate, Manage \u0026 Market Yourself","author":"Lisa McInnes-Smith, Daniel Johnson, and Winston Marsh","synopsis":"Throughout Australia and overseas thousands of people have benefited from seminars, conferences and training courses conducted by Lisa, Daniel and Winston.  Now their message is available in this compelling 'how to' book filled with simple practical ideas you will implement immediately.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"56464043ecd3c0c7ab98fd91"},"owner":"BDA","title":"The Pocket Lawyer for Filmmakers","author":"Thomas A. Crowell, Esq.","synopsis":"* How can you use a state's film tax credits to fund your film? SEE PAGE 63.\n\n* You have an idea you want to pitch to a production company; how do you safeguard your concept? SEE PAGE 77. \n\n* How can you fund your production with product placement? SEE PAGE 157.\n\n* How do you get a script to popular Hollywood actors and deal with their agents? SEE PAGE 222. \n\n Find quick answers to these and hundreds of other questions in this new edition of The Pocket Lawyer for Filmmakers. This no-nonsense reference provides fast answers in plain English-no law degree required! Arm yourself with the practical advice of author Thomas Crowell, a TV-producer-turned-entertainment-lawyer.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"56464093ecd3c0c7ab98fd92"},"owner":"BDA","title":"Flashback: A Brief History of Film","author":"Louis Giannetti \u0026 Scott Eyman","synopsis":"Consolidating major figures and film movements into their decade of greatest influence or prestige, this “no-nonsense” book offers a generously illustrated, concise, and very readable history of fiction movies with an emphasis on American cinema. Eclectic in methodology and written in a plain English style that audiences can relate to, it examines the full scope of traditional film history and criticism, viewing film as both an art and an industry– as it mirrors popular audience values, social ideologies, and historical epochs. Film discussions include titles such as Forrest Gump, Jurassic Park, There's Something About Mary, Face Off, the Lion King, Saving Private Ryan, Good Will Hunting, Pulp Fiction, Choosing Amy, The Piano, Menace II Society, Sweet Hereafter, The English Patient, Sense and Sensibility, Shakespeare in live, The Full Monty, The Crying Game, Life is Beautiful, and like Water for Chocolate. For anyone who enjoys going to, and thinking about, the movies.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"5646419becd3c0c7ab98fd93"},"owner":"BDA","title":"Illuminating Shadows: The Mythic Power of Film","author":"Geoffrey Hill","synopsis":"In this, the first book-length study of film as a vehicle of mythology, Geoffrey Hill asserts that the movie theater is the modern equivalent of the tribal dreamhouse.  In this engaging analyses of seventeen films - from \"It's a Wonderful Life\" to \"Blue Velvet\" - he uncovers timeless mythic themes as well as patterns unique to our own age.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"564641f6ecd3c0c7ab98fd94"},"owner":"BDA","title":"First Thing's First:  The Ultimate Guidebook for Emerging Nonprofits","author":"Tom Iselin","synopsis":"First Things First is a guidebook for leaders of nonprofits. It focuses on a set of governing principles, operational structures, and practical tactics board members, executives, and managers should adopt and apply if they are serious about fulfilling their missions and building sustainable nonprofits of superior quality.\n\nEach chapter provides a case study example that relates chapter topics to experiences Iselin had during the five years he spent as chief executive at SVAS.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"564642d7ecd3c0c7ab98fd95"},"owner":"BDA","title":"Understanding Color: An Introduction for Designers","author":"Linda Holtzschue","synopsis":"Make Sound Color Choices\nNow in an updated Fourth Edition, Understanding Color helps you connect the dots between your emotional, intuitive responses to color and the theories that explain them. From this authoritative and easy-to-follow resource, you'll learn how to use color more comfortably, creatively, and effectively than ever before.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"56464455ecd3c0c7ab98fd96"},"owner":"BDA","title":"MIndfulness, Acceptance, and Positive Psychology: The Seven Foundations of Well-Being (The Context Press Mindfulness and Acceptance Practica Series)","author":"Context Press - Edited by Todd B. Kashdan, PhD \u0026 Joseph Ciarrochi, PhD","synopsis":"Many have wondered if there is a key ingredient to living a full and happy life. For decades now, scientists and psychologists alike have been studying the strengths and virtues that enable individuals and communities to thrive. The positive psychology movement was founded on the belief that people want to lead meaningful and fulfilling lives, to cultivate what is best within themselves, and to enhance their experiences of love, work, and play. At the same time, acceptance and commitment therapy (ACT)—a mindfulness-based, values-oriented behavioral therapy that has many parallels to Buddhism, yet is not religious in any way—has been focused on helping people achieve their greatest human potential.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"564644d7ecd3c0c7ab98fd97"},"owner":"BDA","title":"Social Business by Design: Transformative Social Media Strategies for the Connected Company ","author":"Dion Hinchcliffe","synopsis":"From the Dachis Group the global leader in social business comes the groundbreaking book on transformative social business strategies. Social Business By Design is the definitive management book on how to rethink the modern organization in the social media era. Based on their research and work through the Dachis Group, thought leaders Dion Hinchcliffe and Peter Kim deftly explore how the social, cultural, and technological trends provoked by the social media explosion are transforming the business environment. Designed as both a strategic overview and a hands-on resource, Social Business By Design clearly shows how to choose and implement a social business strategy and maximize its impact. * Explains the mechanisms, applications, and advantages of a strategic array of social media topics, including social media marketing, social product development, crowdsourcing, social supply chains, social customer relationship management, and more * Features examples from high-profile companies such as SAP, Procter \u0026 Gamble, MillerCoors, Bloomberg, HBO, Ford, and IBM who have implemented social business strategies * Draws on the extensive research and expertise of the Dachis Group, which has helped numerous Fortune 500 clients plan, build, and activate effective social business solutions.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"56464516ecd3c0c7ab98fd98"},"owner":"BDA","title":"How to be a Graphic Designer Without Losing Your Soul","author":"Adrian Shaughnessy","synopsis":"Designers are quick to tell us about their sources of inspiration, but they are much less willing to reveal such critical matters as how to find work, how much they charge, and what to do when a client rejects three weeks of work and refuses to pay the bill. How to be a graphic designer without losing your soul addresses the concerns of young designers who want to earn a living by doing expressive and meaningful work, and who want to avoid becoming hired drones working on soulless projects. Written by a designer for designers, it combines practical advice with philosophical guidance to help young professionals embark on their careers.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"564645bcecd3c0c7ab98fd99"},"owner":"BDA","title":"Basics of Video Lighting","author":"Des Lyver \u0026 Graham Swainson","synopsis":"Now fully updated by Des Lyver to reflect the latest advances, the second edition of Basics of Video Lighting is a primer for anyone wishing to learn about lighting a video production. It describes the principles and processes involved in obtaining professional results in educational, training and corporate environments.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"56464623ecd3c0c7ab98fd9a"},"owner":"BDA","title":"Devotional Cinema","author":"Nathaniel Dorksy","synopsis":"Literary Nonfiction. Cinema Studies. Revised 3rd Edition. Devotional Cinema offers an exploration into the language of film, reprised from a lecture on religion and cinema delivered at Princeton University. The new edition includes additions and changes related to the author's understanding of Carl Theodor Dreyer's The Passion of Joan of Arc as well as other smaller clarifications. Dorsky has been making and exhibiting films within the avant-garde tradition since 1964.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"5646465fecd3c0c7ab98fd9b"},"owner":"BDA","title":"Color Photography: A Working Manual","author":"Henry Horenstein","synopsis":"This guide to photographing and processing in colour starts with an historical overview and moves into practical advice on types of film and how to photograph in colour in different light conditions, how to adjust for best exposure, and how to use filters to alter colour balance. Film processing is reviewed in detail, along with a section on how to work with professional labs, since many photographers do not process their own colour film. A section on colour printing is intended particularly for students and committed amateurs, and other chapters cover health and environmental hazards and how to minimize them as well as long-term permanence of colour materials.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"564646d0ecd3c0c7ab98fd9c"},"owner":"BDA","title":"The World Needs Your Kid: Raising Children Who Care and Contribute","author":"Craig Kielburger, Marc Kielburger, and Shelley Page","synopsis":"The Dalai Lama has observed that the greatest challenge facing our time is that we're raising a generation of passive bystanders. If he is right, then the most vital work in this moment belongs to parents, grandparents, mentors and teachers. Inside this inspiring guide, you'll find life lessons from remarkable individuals, committed parents, and compassionate children. Contributors include Archbishop Desmond Tutu, Mia Farrow, Jane Fonda, Robert Kennedy Jr., Jason Mraz, and Dr. Jane Goodall. Read revealing stories and insights from the not-so-typical childhoods of Craig and Marc Kielburger. The brothers, whose work now inspires more than a million youth every year, share groundbreaking lessons on teaching kids to care. Discover how small actions every day can make the world a better place. Find out how those same small actions can have a lasting influence on your child's life. After all, it's a proven fact that doing good for the world does a world of good for friendships, grades, and self-esteem.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"56464720ecd3c0c7ab98fd9d"},"owner":"BDA","title":"Reservations","author":"Diane Keaton","synopsis":"Photographs by Diane Keaton","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":""}
{"_id":{"$oid":"5646542f073ca863cab9dc45"},"owner":"KelShuh","title":"Tacos and You","author":"Austin Johnson","synopsis":"Your relationship with Tacos.","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":"","co_date":"Fri Nov 13 2015 14:36:12 GMT-0700 (MST)","due_date":"Fri Nov 27 2015 14:36:12 GMT-0700 (MST)"}
{"_id":{"$oid":"564655a8073ca863cab9dc46"},"owner":"KelShuh","title":"jlakjd","author":"lkjaslk","synopsis":"lkajsdfl","status":"in","rating":"","checkOutDate":"","dueDate":"","customer":"","co_date":"Fri Nov 13 2015 14:36:14 GMT-0700 (MST)","due_date":"Fri Nov 27 2015 14:36:14 GMT-0700 (MST)"}
{"_id":{"$oid":"5647b289ad0c89289ba66349"},"name":"Tacos and You","author":"Austin Johnson","owner":"CodeCraft","synopsis":"Your relationship with Tacos","rating":"4.0","checkoutDate":"null","dueDate":"null","status":"in","customer":"null"}
